[
  {
    "id" : "0",
    "name" : "Dark Souls 3",
    "description":"Dont even try" ,
    "imageUrl": "assets/0.png",
    "type": "RPG",
    "whoHas": ["SoulsLover"],
    "whoWant": ["Newbie"]
  },
  {
    "id" : "1",
    "name" : "Battelfield 1",
    "description":"Kill everyone" ,
    "imageUrl": "assets/1.png",
    "type": "FPS",
    "whoHas": ["Newbie","BadBoy"],
    "whoWant": []
  },
  {
    "id" : "2",
    "name" : "The Elder Scrolls V: Skyrim",
    "description":"The Elder Scrolls V: Skyrim is an open world action role-playing video game developed by Bethesda Game Studios and published by Bethesda Softworks. It is the fifth main installment in The Elder Scrolls series, following The Elder Scrolls IV: Oblivion, and was released worldwide for Microsoft Windows, PlayStation 3 and Xbox 360 on November 11, 2011. The game's main story revolves around the player character and their quest to defeat Alduin the World-Eater, a dragon who is prophesied to destroy the world. The game is set two hundred years after the events of Oblivion, and takes place in the fictional province of Skyrim. Over the course of the game, the player completes quests and develops the character by improving skills. The game continues the open world tradition of its predecessors by allowing the player to travel anywhere in the game world at any time, and to ignore or postpone the main storyline indefinitely." ,
    "imageUrl": "assets/2.png",
    "type": "RPG",
    "whoHas": ["DragonBlood"],
    "whoWant": []
  },
  {
    "id" : "3",
    "name" : "The Witcher 3: Wild Hunt",
    "description":"The Witcher® 3: Wild Hunt is a story-driven, next-generation open world role-playing game, set in a visually stunning fantasy universe, full of meaningful choices and impactful consequences. You play as Geralt of Rivia, a monster hunter tasked with finding a child from an ancient prophecy" ,
    "imageUrl": "assets/3.png",
    "type": "RPG",
    "whoHas": [],
    "whoWant": ["Geralt99"]
  },
  {
    "id" : "4",
    "name" : "Need for speed: Carbon",
    "description":"Need for Speed: Carbon gameplay is similar to Need for Speed: Most Wanted and Underground 2, but based upon rival street racing crews instead of individuals. Players run a crew and can hire specific street racers to be in their crew and the active friendly racer is known as a wingman." ,
    "imageUrl": "assets/4.png",
    "type": "Racing",
    "whoHas": ["FastAndFurious"],
    "whoWant": []
  },
  {
    "id" : "5",
    "name" : "Grand Theft Auto V",
    "description":"Grand Theft Auto V is an action-adventure video game developed by Rockstar North and published by Rockstar Games. It was released in September 2013 for PlayStation 3 and Xbox 360, in November 2014 for PlayStation 4 and Xbox One, and in April 2015 for Microsoft Windows. It is the first main entry in the Grand Theft Auto series since 2008's Grand Theft Auto IV. Set within the fictional state of San Andreas, based on Southern California, the single-player story follows three criminals and their efforts to commit heists while under pressure from a government agency. The open world design lets players freely roam San Andreas' open countryside and the fictional city of Los Santos, based on Los Angeles." ,
    "imageUrl": "assets/5.png",
    "type": "Action",
    "whoHas": ["Trevor"],
    "whoWant": ["Newbie"]
  },
  {
    "id" : "6",
    "name" : "Tomb Raider",
    "description":"Tomb Raider is presented in third-person perspective. Players take control of the series lead character Lara Croft. The game uses an interconnected hub-and-spoke model that combines action-adventure, exploration, and survival mechanics.[7] Players can traverse between the camps and across the island using footpaths, improvised or already-available ziplines and climbable tracks. Many of the players moves are carried over from the previous games created by Crystal Dynamics, with some tweaks added, such as incorporating elements of stealth gameplay. Quick Time Events are scattered at regular intervals throughout the game, often appearing at crucial or fast-moving points in the game's plot, such as extracting a shard of metal, and escaping a collapsing cave." ,
    "imageUrl": "assets/6.png",
    "type": "Action, Adventure",
    "whoHas": ["LaraCroft"],
    "whoWant": ["BadBoy","Newbie"]
  },
  {
    "id" : "7",
    "name" : "StarCraft II: Wings of Liberty",
    "description":"StarCraft II: Wings of Liberty features the return of the three species from the original game: Protoss, Terran, and Zerg. In the Terran campaign, the original StarCraft briefing room is replaced with an interactive version of the battlecruiser Hyperion, with Jim Raynor, now a bitter and hard-drinking mercenary captain, as the central character. In a departure from previous Blizzard games, the campaign is non-linear, with Raynor taking jobs for money and using that money to buy additional units and upgrades. Although each play through will vary, the end result remains consistent, keeping the storyline linear. Blizzard's Vice President Rob Pardo stressed that each campaign will function very differently. The Terran campaign, Wings of Liberty, places players in a mercenary-style campaign, as Terran rebel group Raynor's Raiders raise funds by taking assignments from outside groups. The second release, Heart of the Swarm, is Zerg-focused and has role-playing elements. Kerrigan is the focus of the campaign, and the story revolves around the possibility of her redemption. The Protoss-themed Legacy of the Void is the final expansion, with the Protoss Artanis attempting to reunite the Protoss tribes in order to stop Amon, a fallen Xel'Naga." ,
    "imageUrl": "assets/7.png",
    "type": "RTS",
    "whoHas": ["KoreanKid"],
    "whoWant": []
  },
  {
    "id" : "8",
    "name" : "StarCraft II: Heart of the Swarm",
    "description":"Heart of the Swarm has 20 missions in the campaign (plus seven evolution missions which allows the player to upgrade its units), and continues the story from Wings of Liberty. The player plays from the perspective of Sarah Kerrigan, recently returned to her human form by Jim Raynor. Similar to Wings of Liberty, the briefing room is replaced with an interactive exploration of the Leviathan, an enormous Zerg breed which functions as a bioship. Kerrigan and her allies are located in the nerve center. She has a personal chamber for altering her abilities, and there is an evolution pit where she can upgrade her units and perform evolution missions with the evolution master Abathur." ,
    "imageUrl": "assets/8.png",
    "type": "RTS",
    "whoHas": ["KoreanKid"],
    "whoWant": []
  }

]